---
kind: property
id: P:Autodesk.Revit.DB.MEPCurve.ConnectorManager
source: html/5498400a-b28b-786d-170e-383cc0e67875.htm
---
# Autodesk.Revit.DB.MEPCurve.ConnectorManager Property

The connector manager of this MEP curve.

## Syntax (C#)
```csharp
public ConnectorManager ConnectorManager { get; }
```